burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_dma.c
/*!
    \file    gd32m53x_dma.c
    \brief   DMA driver

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/


#include "gd32m53x_dma.h"
#include <stdlib.h>

#define DMA_WRONG_HANDLE        while(1){}

/*!
    \brief      deinitialize DMA channel registers (API_ID(0x0001U))
    \param[in]  dma_periph: DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel is deinitialized
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..5 for DMA0, x = 0..5 for DMA1)
    \param[out] none
    \retval     none
*/
void dma_deinit(uint32_t dma_periph, dma_channel_enum channelx)
{
    /* disable DMA a channel */
    DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_CHEN;
    /* reset DMA channel registers */
    DMA_CHCTL(dma_periph, channelx) = DMA_CHCTL_RESET_VALUE;
    DMA_CHCNT(dma_periph, channelx) = DMA_CHCNT_RESET_VALUE;
    DMA_CHPADDR(dma_periph, channelx) = DMA_CHPADDR_RESET_VALUE;
    DMA_CHMADDR(dma_periph, channelx) = DMA_CHMADDR_RESET_VALUE;
    DMA_INTC(dma_periph) |= DMA_FLAG_ADD(DMA_CHINTF_RESET_VALUE, channelx);
}

/*!
    \brief      initialize the parameters of DMA struct with the default values (API_ID(0x0002U))
    \param[in]  init_struct: the initialization data needed to initialize DMA channel
    \param[out] none
    \retval     none
*/
void dma_struct_para_init(dma_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* set the DMA struct with the default values */
        init_struct->periph_addr  = 0U;
        init_struct->periph_width = 0U;
        init_struct->periph_inc   = (uint8_t)DMA_PERIPH_INCREASE_DISABLE;
        init_struct->memory_addr  = 0U;
        init_struct->memory_width = 0U;
        init_struct->memory_inc   = (uint8_t)DMA_MEMORY_INCREASE_DISABLE;
        init_struct->number       = 0U;
        init_struct->direction    = (uint8_t)DMA_PERIPHERAL_TO_MEMORY;
        init_struct->priority     = (uint32_t)DMA_PRIORITY_LOW;
        init_struct->request      = DMA_REQUEST_M2M;
    }
}

/*!
    \brief      initialize DMA channel (API_ID(0x0003U))
    \param[in]  dma_periph: DMAx(x=0,1)
    \param[in]  channelx: specify which DMA channel is initialized
                only one parameter can be selected which is shown as below:
      \arg        DMA_CHx(x=0..5)
    \param[in]  init_struct: the data needed to initialize DMA channel
                  periph_addr: peripheral base address
                  periph_width: DMA_PERIPHERAL_WIDTH_8BIT,DMA_PERIPHERAL_WIDTH_16BIT,DMA_PERIPHERAL_WIDTH_32BIT
                  periph_inc: DMA_PERIPH_INCREASE_ENABLE,DMA_PERIPH_INCREASE_DISABLE
                  memory_addr: memory base address
                  memory_width: DMA_MEMORY_WIDTH_8BIT,DMA_MEMORY_WIDTH_16BIT,DMA_MEMORY_WIDTH_32BIT
                  memory_inc: DMA_MEMORY_INCREASE_ENABLE,DMA_MEMORY_INCREASE_DISABLE
                  direction: DMA_PERIPHERAL_TO_MEMORY,DMA_MEMORY_TO_PERIPHERAL
                  number: the number of remaining data to be transferred by the DMA
                  priority: DMA_PRIORITY_LOW,DMA_PRIORITY_MEDIUM,DMA_PRIORITY_HIGH,DMA_PRIORITY_ULTRA_HIGH
                  request:
                    DMA_REQUEST_M2M,,           DMA_REQUEST_GENERATOR0,     DMA_REQUEST_GENERATOR1,     DMA_REQUEST_GENERATOR2,
                    DMA_REQUEST_GENERATOR3,     DMA_REQUEST_ADC0_A,         DMA_REQUEST_ADC2_A,         DMA_REQUEST_ADC0_B,
                    DMA_REQUEST_ADC2_B,         DMA_REQUEST_ADC0_C,         DMA_REQUEST_ADC2_C,         DMA_REQUEST_I2C0_RX,
                    DMA_REQUEST_I2C0_TX,        DMA_REQUEST_UART0_RX,       DMA_REQUEST_UART0_TX,       DMA_REQUEST_UART1_RX,
                    DMA_REQUEST_UART1_TX,       DMA_REQUEST_UART2_RX,       DMA_REQUEST_UART2_TX,       DMA_REQUEST_UART3_RX,
                    DMA_REQUEST_UART3_TX,       DMA_REQUEST_SPI0_RX,        DMA_REQUEST_SPI0_TX,        DMA_REQUEST_TIMER0_UP,
                    DMA_REQUEST_TIMER0_CMT,     DMA_REQUEST_TIMER0_TRG,     DMA_REQUEST_TIMER0_CH0,     DMA_REQUEST_TIMER0_CH1,
                    DMA_REQUEST_TIMER0_CH2,     DMA_REQUEST_TIMER0_CH3,     DMA_REQUEST_TIMER0_MCH0,    DMA_REQUEST_TIMER0_MCH1,
                    DMA_REQUEST_TIMER0_MCH2,    DMA_REQUEST_TIMER0_MCH3,    DMA_REQUEST_TIMER7_UP,      DMA_REQUEST_TIMER7_CMT,
                    DMA_REQUEST_TIMER7_TRG,     DMA_REQUEST_TIMER7_CH0,     DMA_REQUEST_TIMER7_CH1,     DMA_REQUEST_TIMER7_CH2,
                    DMA_REQUEST_TIMER7_CH3,     DMA_REQUEST_TIMER7_MCH0,    DMA_REQUEST_TIMER7_MCH1,    DMA_REQUEST_TIMER7_MCH2,
                    DMA_REQUEST_TIMER7_MCH3,    DMA_REQUEST_TIMER1_UP,      DMA_REQUEST_TIMER1_TRG,     DMA_REQUEST_TIMER1_CH0,
                    DMA_REQUEST_TIMER1_CH1,     DMA_REQUEST_TIMER1_CH1,     DMA_REQUEST_TIMER1_CH3,     DMA_REQUEST_TIMER2_UP,
                    DMA_REQUEST_TIMER2_TRG,     DMA_REQUEST_TIMER2_CH0,     DMA_REQUEST_TIMER2_CH1,     DMA_REQUEST_TIMER2_CH2,
                    DMA_REQUEST_TIMER2_CH3,     DMA_REQUEST_TMU_OUTPUT,     DMA_REQUEST_TMU_INPUT,      DMA_REQUEST_GPTIMER0_UP,
                    DMA_REQUEST_GPTIMER0_PRD,   DMA_REQUEST_GPTIMER0_CH0,   DMA_REQUEST_GPTIMER0_CH1,   DMA_REQUEST_GPTIMER1_UP,
                    DMA_REQUEST_GPTIMER1_PRD,   DMA_REQUEST_GPTIMER1_CH0,   DMA_REQUEST_GPTIMER1_CH1,   DMA_REQUEST_EVIC0,
                    DMA_REQUEST_EVIC1,          DMA_REQUEST_EVIC2,          DMA_REQUEST_EVIC3,          DMA_REQUEST_EVIC4,
                    DMA_REQUEST_EVIC5,          DMA_REQUEST_EVIC6,          DMA_REQUEST_EVIC7,          DMA_REQUEST_EVIC8,
                    DMA_REQUEST_EVIC9,          DMA_REQUEST_ADC0_D,         DMA_REQUEST_ADC2_D,         DMA_REQUEST_GPTIMER0_CH0COMV_ADD
                    DMA_REQUEST_GPTIMER0_CH1COMV_ADD,     DMA_REQUEST_GPTIMER1_CH0COMV_ADD,     DMA_REQUEST_GPTIMER1_CH1COMV_ADD,     DMA_REQUEST_EVIC10,
                    DMA_REQUEST_EVIC11,
    \param[out] none
    \retval     none
*/
void dma_init(uint32_t dma_periph, dma_channel_enum channelx, dma_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_DMAMUX_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t ctl;
        if(NULL == init_struct) {
            DMA_WRONG_HANDLE
        }

        dma_channel_disable(dma_periph, channelx);

        /* configure peripheral base address */
        DMA_CHPADDR(dma_periph, channelx) = init_struct->periph_addr;

        /* configure memory base address */
        DMA_CHMADDR(dma_periph, channelx) = init_struct->memory_addr;

